XiaoData/OFfiles/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.00000001";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
14751
(
(0.001638273327410455 9.377537809004315e-08 2.095009265619975e-19)
(0.00163275301640737 -6.94940782064283e-08 -6.533866669163589e-20)
(0.00163550934243571 1.12066815600051e-07 -1.017651436102854e-20)
(0.001627259795417741 9.834758647851526e-08 5.504475496164016e-21)
(0.001623042258131181 1.663243787114356e-07 -5.196149993620559e-20)
(0.001612575641639095 1.968844085011913e-07 -7.812709846176247e-20)
(0.001601481082455558 2.369667504886158e-07 1.00393829922572e-21)
(0.001587544460589613 2.691055688444825e-07 -1.255354544256418e-19)
...
)
;

boundaryField
{
    bottomWall
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
