XiaoData/OFfiles/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<vector> 
14751
(
(8.954546133954754 3.034000089741324 0.05)
(8.863635946557393 3.034000124510496 0.05000000000000001)
(8.772726971594178 3.034000026634675 0.05)
(8.681818014430785 3.033999949549799 0.05)
(8.590909030448447 3.033999892463884 0.05)
(8.499999887976928 3.033999845106867 0.05)
(8.409090746119441 3.03399979280616 0.05000000000000001)
(8.318181803887697 3.033999764820312 0.05000000000000001)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(0.04545454545500001 1 0.05)
(0.136363636355 0.9981176030000001 0.05000000000000001)
(0.2272727272500001 0.9882624724500002 0.05000000000000001)
(0.31818181815 0.9627578342999999 0.05)
(0.4090909090499999 0.9176993420999999 0.05)
(0.4999999999999998 0.8558293050999998 0.05)
(0.5909090909500001 0.78342766405 0.05)
(0.68181818185 0.7064703305499999 0.05)
...
)
;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(8.9545454545 3.036 0.05)
(8.863636363499998 3.036 0.05)
(8.772727272499999 3.036 0.05)
(8.681818181500001 3.036 0.05)
(8.5909090905 3.036 0.05)
(8.499999999999998 3.036 0.05)
(8.4090909095 3.036 0.05)
(8.318181818499998 3.036 0.05)
...
)
;
    }
}


// ************************************************************************* //
