XiaoData/OFfiles/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
14751
(
8.954546133954754
8.863635946557393
8.772726971594178
8.681818014430785
8.590909030448447
8.499999887976928
8.409090746119441
8.318181803887697
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.04545454545500001
0.136363636355
0.2272727272500001
0.31818181815
0.4090909090499999
0.4999999999999998
0.5909090909500001
0.68181818185
...
)
;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
8.9545454545
8.863636363499998
8.772727272499999
8.681818181500001
8.5909090905
8.499999999999998
8.4090909095
8.318181818499998
...
)
;
    }
}


// ************************************************************************* //
