XiaoData/OFfiles/0/surfaceFrictionRef
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      surfaceFrictionRef;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
7.7265476365549128e-04
7.3319767658469169e-04
-1.1981782311773961e-03
-2.5263717097063010e-03
-1.8475313862362981e-03
-1.4314564239800347e-03
-1.0848518268530569e-03
-9.2170251069443492e-04
...
)
;
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
