XiaoData/OFfiles/0/varRefFieldInversion
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.00000001";
    object      varRefFieldInversion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
14751
(
(0.001597599711345916 -1.096277154485122e-07 3.626661525926551e-06)
(0.001601309124885187 -5.880052687207999e-08 3.645598842016809e-06)
(0.001602325036278087 -9.929251115233551e-09 3.651074255792304e-06)
(0.001600579650526554 3.327960235774228e-08 3.645673762305472e-06)
(0.001596117532933239 9.525992722294042e-08 3.651557832319975e-06)
(0.001588977634670945 1.984496144936817e-07 3.689956884161709e-06)
(0.001579228496587263 3.042087364998284e-07 3.756312479850326e-06)
(0.001567019766431359 4.076811833294853e-07 3.83224680792587e-06)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            symmetry;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
